graph CNTKGraph (
  %Input13165[FLOAT, Sequencex1x3]
) optional inputs with matching initializers (
  %Constant13649PastValue16544[FLOAT, 1x2]
  %Constant13649PastValue16566[FLOAT, 1x2]
  %Constant14356PastValue16519[FLOAT, 1x2]
  %Constant14356PastValue16541[FLOAT, 1x2]
  %Constant15063PastValue16494[FLOAT, 1x2]
  %Constant15063PastValue16516[FLOAT, 1x2]
  %Constant15770PastValue16469[FLOAT, 1x2]
  %Constant15770PastValue16491[FLOAT, 1x2]
  %b_1[FLOAT, 8]
  %b[FLOAT, 8]
  %W_1[FLOAT, 2x8]
  %W[FLOAT, 2x8]
  %H[FLOAT, 2x8]
  %b_0[FLOAT, 8]
  %W_0[FLOAT, 2x8]
  %H_0[FLOAT, 2x8]
  %H_1[FLOAT, 2x8]
  %b_2[FLOAT, 8]
  %W_2[FLOAT, 3x8]
  %H_2[FLOAT, 2x8]
) {
  %PastValue16544_Output_0, %PastValue16566_Output_0, %ElementTimes16595_Output_0 = Scan[body = <graph CNTKGraph>, num_scan_inputs = 1, scan_input_directions = [0], scan_output_directions = [0]](%Constant13649PastValue16544, %Constant13649PastValue16566, %Input13165)
  %PastValue16519_Output_0, %PastValue16541_Output_0, %ElementTimes16623_Output_0 = Scan[body = <graph CNTKGraph>, num_scan_inputs = 1, scan_input_directions = [0], scan_output_directions = [0]](%Constant14356PastValue16519, %Constant14356PastValue16541, %ElementTimes16595_Output_0)
  %PastValue16494_Output_0, %PastValue16516_Output_0, %ElementTimes16651_Output_0 = Scan[body = <graph CNTKGraph>, num_scan_inputs = 1, scan_input_directions = [0], scan_output_directions = [0]](%Constant15063PastValue16494, %Constant15063PastValue16516, %ElementTimes16623_Output_0)
  %PastValue16469_Output_0, %PastValue16491_Output_0, %ElementTimes16679_Output_0 = Scan[body = <graph CNTKGraph>, num_scan_inputs = 1, scan_input_directions = [0], scan_output_directions = [0]](%Constant15770PastValue16469, %Constant15770PastValue16491, %ElementTimes16651_Output_0)
  return %PastValue16544_Output_0, %PastValue16566_Output_0, %PastValue16519_Output_0, %PastValue16541_Output_0, %PastValue16494_Output_0, %PastValue16516_Output_0, %PastValue16469_Output_0, %PastValue16491_Output_0, %ElementTimes16679_Output_0
}

graph CNTKGraph (
  %Constant13649PastValue16544_subgraph[FLOAT, 1x2]
  %Constant13649PastValue16566_subgraph[FLOAT, 1x2]
  %Input13165_subgraph[FLOAT, 1x3]
) {
  %Block16574_Output_0 = Identity(%Constant13649PastValue16544_subgraph)
  %Times16585_Output_0 = MatMul(%Block16574_Output_0, %H_2)
  %Block16574_Output_2 = Identity(%Input13165_subgraph)
  %Times16581_Output_0 = MatMul(%Block16574_Output_2, %W_2)
  %Plus16583_Output_0 = Add(%b_2, %Times16581_Output_0)
  %Plus16587_Output_0 = Add(%Plus16583_Output_0, %Times16585_Output_0)
  %Slice16558_Output_0 = Slice[axes = [1], ends = [4], starts = [2]](%Plus16587_Output_0)
  %Tanh16560_Output_0 = Tanh(%Slice16558_Output_0)
  %Slice16554_Output_0 = Slice[axes = [1], ends = [2], starts = [0]](%Plus16587_Output_0)
  %StableSigmoid16556_Output_0 = Sigmoid(%Slice16554_Output_0)
  %ElementTimes16562_Output_0 = Mul(%StableSigmoid16556_Output_0, %Tanh16560_Output_0)
  %Block16574_Output_1 = Identity(%Constant13649PastValue16566_subgraph)
  %Slice16547_Output_0 = Slice[axes = [1], ends = [6], starts = [4]](%Plus16587_Output_0)
  %StableSigmoid16549_Output_0 = Sigmoid(%Slice16547_Output_0)
  %ElementTimes16552_Output_0 = Mul(%StableSigmoid16549_Output_0, %Block16574_Output_1)
  %Plus16564_Output_0 = Add(%ElementTimes16552_Output_0, %ElementTimes16562_Output_0)
  %Tanh16593_Output_0 = Tanh(%Plus16564_Output_0)
  %Slice16589_Output_0 = Slice[axes = [1], ends = [8], starts = [6]](%Plus16587_Output_0)
  %StableSigmoid16591_Output_0 = Sigmoid(%Slice16589_Output_0)
  %ElementTimes16595_Output_0 = Mul(%StableSigmoid16591_Output_0, %Tanh16593_Output_0)
  %scan_ElementTimes16595_Output_0_extended_from_ = Identity(%ElementTimes16595_Output_0)
  %PastValue16566_Output_0 = Identity(%Plus16564_Output_0)
  %PastValue16544_Output_0 = Identity(%ElementTimes16595_Output_0)
  return %PastValue16544_Output_0, %PastValue16566_Output_0, %scan_ElementTimes16595_Output_0_extended_from_
}

graph CNTKGraph (
  %Constant14356PastValue16519_subgraph[FLOAT, 1x2]
  %Constant14356PastValue16541_subgraph[FLOAT, 1x2]
  %ElementTimes16595_Output_0_subgraph[FLOAT, 1x2]
) {
  %Block16602_Output_0 = Identity(%Constant14356PastValue16519_subgraph)
  %Times16613_Output_0 = MatMul(%Block16602_Output_0, %H_1)
  %Block16602_Output_2 = Identity(%ElementTimes16595_Output_0_subgraph)
  %Times16609_Output_0 = MatMul(%Block16602_Output_2, %W_1)
  %Plus16611_Output_0 = Add(%b_1, %Times16609_Output_0)
  %Plus16615_Output_0 = Add(%Plus16611_Output_0, %Times16613_Output_0)
  %Slice16533_Output_0 = Slice[axes = [1], ends = [4], starts = [2]](%Plus16615_Output_0)
  %Tanh16535_Output_0 = Tanh(%Slice16533_Output_0)
  %Slice16529_Output_0 = Slice[axes = [1], ends = [2], starts = [0]](%Plus16615_Output_0)
  %StableSigmoid16531_Output_0 = Sigmoid(%Slice16529_Output_0)
  %ElementTimes16537_Output_0 = Mul(%StableSigmoid16531_Output_0, %Tanh16535_Output_0)
  %Block16602_Output_1 = Identity(%Constant14356PastValue16541_subgraph)
  %Slice16522_Output_0 = Slice[axes = [1], ends = [6], starts = [4]](%Plus16615_Output_0)
  %StableSigmoid16524_Output_0 = Sigmoid(%Slice16522_Output_0)
  %ElementTimes16527_Output_0 = Mul(%StableSigmoid16524_Output_0, %Block16602_Output_1)
  %Plus16539_Output_0 = Add(%ElementTimes16527_Output_0, %ElementTimes16537_Output_0)
  %Tanh16621_Output_0 = Tanh(%Plus16539_Output_0)
  %Slice16617_Output_0 = Slice[axes = [1], ends = [8], starts = [6]](%Plus16615_Output_0)
  %StableSigmoid16619_Output_0 = Sigmoid(%Slice16617_Output_0)
  %ElementTimes16623_Output_0 = Mul(%StableSigmoid16619_Output_0, %Tanh16621_Output_0)
  %scan_ElementTimes16623_Output_0_extended_from_ = Identity(%ElementTimes16623_Output_0)
  %PastValue16541_Output_0 = Identity(%Plus16539_Output_0)
  %PastValue16519_Output_0 = Identity(%ElementTimes16623_Output_0)
  return %PastValue16519_Output_0, %PastValue16541_Output_0, %scan_ElementTimes16623_Output_0_extended_from_
}

graph CNTKGraph (
  %Constant15063PastValue16494_subgraph[FLOAT, 1x2]
  %Constant15063PastValue16516_subgraph[FLOAT, 1x2]
  %ElementTimes16623_Output_0_subgraph[FLOAT, 1x2]
) {
  %Block16630_Output_0 = Identity(%Constant15063PastValue16494_subgraph)
  %Times16641_Output_0 = MatMul(%Block16630_Output_0, %H_0)
  %Block16630_Output_2 = Identity(%ElementTimes16623_Output_0_subgraph)
  %Times16637_Output_0 = MatMul(%Block16630_Output_2, %W_0)
  %Plus16639_Output_0 = Add(%b_0, %Times16637_Output_0)
  %Plus16643_Output_0 = Add(%Plus16639_Output_0, %Times16641_Output_0)
  %Slice16508_Output_0 = Slice[axes = [1], ends = [4], starts = [2]](%Plus16643_Output_0)
  %Tanh16510_Output_0 = Tanh(%Slice16508_Output_0)
  %Slice16504_Output_0 = Slice[axes = [1], ends = [2], starts = [0]](%Plus16643_Output_0)
  %StableSigmoid16506_Output_0 = Sigmoid(%Slice16504_Output_0)
  %ElementTimes16512_Output_0 = Mul(%StableSigmoid16506_Output_0, %Tanh16510_Output_0)
  %Block16630_Output_1 = Identity(%Constant15063PastValue16516_subgraph)
  %Slice16497_Output_0 = Slice[axes = [1], ends = [6], starts = [4]](%Plus16643_Output_0)
  %StableSigmoid16499_Output_0 = Sigmoid(%Slice16497_Output_0)
  %ElementTimes16502_Output_0 = Mul(%StableSigmoid16499_Output_0, %Block16630_Output_1)
  %Plus16514_Output_0 = Add(%ElementTimes16502_Output_0, %ElementTimes16512_Output_0)
  %Tanh16649_Output_0 = Tanh(%Plus16514_Output_0)
  %Slice16645_Output_0 = Slice[axes = [1], ends = [8], starts = [6]](%Plus16643_Output_0)
  %StableSigmoid16647_Output_0 = Sigmoid(%Slice16645_Output_0)
  %ElementTimes16651_Output_0 = Mul(%StableSigmoid16647_Output_0, %Tanh16649_Output_0)
  %scan_ElementTimes16651_Output_0_extended_from_ = Identity(%ElementTimes16651_Output_0)
  %PastValue16516_Output_0 = Identity(%Plus16514_Output_0)
  %PastValue16494_Output_0 = Identity(%ElementTimes16651_Output_0)
  return %PastValue16494_Output_0, %PastValue16516_Output_0, %scan_ElementTimes16651_Output_0_extended_from_
}

graph CNTKGraph (
  %Constant15770PastValue16469_subgraph[FLOAT, 1x2]
  %Constant15770PastValue16491_subgraph[FLOAT, 1x2]
  %ElementTimes16651_Output_0_subgraph[FLOAT, 1x2]
) {
  %Block16658_Output_0 = Identity(%Constant15770PastValue16469_subgraph)
  %Times16669_Output_0 = MatMul(%Block16658_Output_0, %H)
  %Block16658_Output_2 = Identity(%ElementTimes16651_Output_0_subgraph)
  %Times16665_Output_0 = MatMul(%Block16658_Output_2, %W)
  %Plus16667_Output_0 = Add(%b, %Times16665_Output_0)
  %Plus16671_Output_0 = Add(%Plus16667_Output_0, %Times16669_Output_0)
  %Slice16483_Output_0 = Slice[axes = [1], ends = [4], starts = [2]](%Plus16671_Output_0)
  %Tanh16485_Output_0 = Tanh(%Slice16483_Output_0)
  %Slice16479_Output_0 = Slice[axes = [1], ends = [2], starts = [0]](%Plus16671_Output_0)
  %StableSigmoid16481_Output_0 = Sigmoid(%Slice16479_Output_0)
  %ElementTimes16487_Output_0 = Mul(%StableSigmoid16481_Output_0, %Tanh16485_Output_0)
  %Block16658_Output_1 = Identity(%Constant15770PastValue16491_subgraph)
  %Slice16472_Output_0 = Slice[axes = [1], ends = [6], starts = [4]](%Plus16671_Output_0)
  %StableSigmoid16474_Output_0 = Sigmoid(%Slice16472_Output_0)
  %ElementTimes16477_Output_0 = Mul(%StableSigmoid16474_Output_0, %Block16658_Output_1)
  %Plus16489_Output_0 = Add(%ElementTimes16477_Output_0, %ElementTimes16487_Output_0)
  %Tanh16677_Output_0 = Tanh(%Plus16489_Output_0)
  %Slice16673_Output_0 = Slice[axes = [1], ends = [8], starts = [6]](%Plus16671_Output_0)
  %StableSigmoid16675_Output_0 = Sigmoid(%Slice16673_Output_0)
  %ElementTimes16679_Output_0 = Mul(%StableSigmoid16675_Output_0, %Tanh16677_Output_0)
  %scan_ElementTimes16679_Output_0_extended_from_ = Identity(%ElementTimes16679_Output_0)
  %PastValue16491_Output_0 = Identity(%Plus16489_Output_0)
  %PastValue16469_Output_0 = Identity(%ElementTimes16679_Output_0)
  return %PastValue16469_Output_0, %PastValue16491_Output_0, %scan_ElementTimes16679_Output_0_extended_from_
}